---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.AlignmentId
source: html/0546b98b-a6c8-d23e-275b-8e78ea0594e8.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.AlignmentId Property

The ElementId of the Alignment on which the SpotDimension is placed.

## Syntax (C#)
```csharp
public ElementId AlignmentId { get; }
```